[docs/architecture/overview] added a high level system diagram
Signed-off-by: Dror Kabely <sdrork12@campus.technion.ac.il>
